In [2]:
import pandas as pd
import numpy as np

In [3]:
lista = [["Brasil", "Brasil", "Brasil", "Argentina", "Argentina", "Argentina"], [2017, 2018, 2019, 2017, 2018, 2019]]

In [10]:
tuplas = zip(lista[0], lista[1])
# Ou
tuplas = zip(*lista)

In [11]:
tuplas = list(tuplas)

In [12]:
tuplas

[('Brasil', 2017),
 ('Brasil', 2018),
 ('Brasil', 2019),
 ('Argentina', 2017),
 ('Argentina', 2018),
 ('Argentina', 2019)]

In [13]:
multi = pd.MultiIndex.from_tuples(tuplas)

In [14]:
multi

MultiIndex([(   'Brasil', 2017),
            (   'Brasil', 2018),
            (   'Brasil', 2019),
            ('Argentina', 2017),
            ('Argentina', 2018),
            ('Argentina', 2019)],
           )

In [16]:
df1 = pd.DataFrame(data = np.random.randn(6,2), index=multi, columns=['EXP_TRIGO','EXP_ARROZ'])

In [17]:
df1

                EXP_TRIGO  EXP_ARROZ
Brasil    2017  -0.287514  -0.991418
          2018   0.866166   1.653372
          2019  -0.220883   1.136586
Argentina 2017  -0.829945   0.624998
          2018   0.105398  -0.786798
          2019   0.423536   2.112106

In [18]:
df1.index.names = ['Pais', 'Ano']

In [19]:
df1

                EXP_TRIGO  EXP_ARROZ
Pais      Ano
Brasil    2017  -0.287514  -0.991418
          2018   0.866166   1.653372
          2019  -0.220883   1.136586
Argentina 2017  -0.829945   0.624998
          2018   0.105398  -0.786798
          2019   0.423536   2.112106

In [20]:
# Encontrando valores

In [21]:
df1['EXP_TRIGO']

Pais       Ano
Brasil     2017   -0.287514
           2018    0.866166
           2019   -0.220883
Argentina  2017   -0.829945
           2018    0.105398
           2019    0.423536
Name: EXP_TRIGO, dtype: float64

In [22]:
df1.loc['Brasil']

      EXP_TRIGO  EXP_ARROZ
Ano
2017  -0.287514  -0.991418
2018   0.866166   1.653372
2019  -0.220883   1.136586

In [23]:
df1.xs(2017, level=1)

           EXP_TRIGO  EXP_ARROZ
Pais
Brasil     -0.287514  -0.991418
Argentina  -0.829945   0.624998

In [24]:
df1[:2]

             EXP_TRIGO  EXP_ARROZ
Pais   Ano
Brasil 2017  -0.287514  -0.991418
       2018   0.866166   1.653372

In [28]:
df1[['EXP_TRIGO','EXP_ARROZ']]

                EXP_TRIGO  EXP_ARROZ
Pais      Ano
Brasil    2017  -0.287514  -0.991418
          2018   0.866166   1.653372
          2019  -0.220883   1.136586
Argentina 2017  -0.829945   0.624998
          2018   0.105398  -0.786798
          2019   0.423536   2.112106

In [29]:
# Vendo de outra maneira

In [30]:
df2 = df1.unstack()

In [31]:
df2

          EXP_TRIGO                     EXP_ARROZ
Ano            2017      2018      2019      2017      2018      2019
Pais
Argentina -0.829945  0.105398  0.423536  0.624998 -0.786798  2.112106
Brasil    -0.287514  0.866166 -0.220883 -0.991418  1.653372  1.136586